// - จงเขียนฟังก์ชันในการแปลงตัวเลข โดยให้ผลลัพธ์เป็นตัวเลขที่มีทศนิยม 2 ตำแหน่ง

// - หากตัวเลขที่ต้องการแปลงไม่มีจุดทศนิยมหรือมีทศนิยมไม่ถึง 2 ตำแหน่งให้เติมเลข 0 ต่อท้ายจนได้ทศนิยม 2 ตำแหน่ง
// - เช่น แปลง 10 ต้องได้ 10.00, แปลง 5.1 ต้องได้ 5.10,

// 10 => 10.00
let num1 = 10;
num1.toFixed(2);

let num2 = 6.1;
num2.toFixed(2);

// - หากตัวเลขที่ต้องการแปลงมีจุดทศนิยมมากกว่า 2 ตำแหน่งให้ปัดตัวเลขตั้งแต่หลังจุดทศนิยมตำแหน่งที่ 2 ทิ้งให้หมด
// แปลง 3.1289 ต้องได้ 3.12

let num3 = 3.1289;

// num3.toFixed(2) // 3.13
Math.floor(num3 * 100) / 100;

(Math.floor(num1 * 100) / 100).toFixed(2);
(Math.floor(num2 * 100) / 100).toFixed(2);

function twoPointFloat(num) {
  return (Math.floor(num * 100) / 100).toFixed(2);
}
